Revit 2024 API
CloudPoint Structure
Represents a point obtained from a Point cloud.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public struct CloudPoint
Visual Basic
Public Structure CloudPoint
Visual C++
public value class CloudPoint
See Also
CloudPoint Members
Autodesk.Revit.DB.PointClouds Namespace